Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་བསོད་ནམས་བགྱི་བའི་དངོས་པོ་དེའི་དཔེ་བགྱི་བར་ཡང་དཀའོ།
en: Blessed Lord, it would be hard to exemplify that foundation of meritorious action!

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་བསོད་ནམས་བགྱི་བའི་དངོས་པོ་དེ་ལ། གཟུགས་མཆིས་སུ་ལགས་ན་ནི། འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་ཡང་ཤོང་བར་མི་འགྱུར་རོ།
en: Blessed Lord, if that foundation of meritorious action were material, it could not be accommodated even in all the world systems, numerous as the grains of sand of the river Gaṅgā!”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ལེགས་ས་ལེགས་སོ།
en: The Blessed One then said, “Excellent, Subhūti!

source: ཇི་སྐད་དུ་སྨྲས་པ་དེ་བཞིན་ནོ།
en: It is so, it is as you have said!

source: །རབ་འབྱོར་དེ་བས་ཀྱང་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་དགེ་བའི་རྩ་བ་རྣམས་ཆགས་པ་མེད་པའི་ཡོངས་སུ་བསྔོ་བས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བ་དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ཏེ།
en: Subhūti, the merit dedicated to unsurpassed, complete enlightenment by noble sons or noble daughters who dedicate the roots of virtuous action without attachment would increase manifold to a greater extent.

source: རབ་འབྱོར་དེ་ལྟར་ན་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེའི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་བསྔོ་བ་འདི་ནི་རབ་ཅེས་བྱའོ། །གཙོ་བོ་ཞེས་བྱའོ། །དམ་པ་ཞེས་བྱའོ། །ཕུལ་ཞེས་བྱའོ།
en: So it is, Subhūti, that this dedication of the roots of virtuous action that noble sons or noble daughters make is said to be the best; it is said to be foremost, it is said to be sacred, {Ki.

source: མཆོག་ཅེས་བྱའོ། གྱ་ནོམ་པ་ཞེས་བྱའོ། བླ་ན་མེད་པ་ཞེས་བྱའོ། གོང་ན་མེད་པ་ཞེས་བྱའོ།
en: II-III: 138} it is said to be perfect, it is said to be supreme, it is said to be sublime, it is said to be unsurpassed, and it is said to be highest. “

source: །རབ་འབྱོར་ཆགས་པ་མེད་པའི་ཡོངས་སུ་བསྔོ་བ་འདི་ལ་དགེ་བའི་རྩ་བ་སྔ་མ་དེས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ། །སྟོང་གི་ཆ་དང་བརྒྱ་སྟོང་གི་ཆ་དང་། བྱེ་བ་བརྒྱའི་ཆ་དང་།
en: Subhūti, the aforementioned roots of virtuous action cannot come anywhere near matching even a hundredth part of this dedication that is free from attachment.

source: བྱེ་བ་སྟོང་གི་ཆ་དང་། བྱེ་བ་བརྒྱ་སྟོང་གི་ཆ་དང་། བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གི་ཆ་དང་། གྲངས་དང་ཆ་དང་བགྲང་བ་དང་དཔེ་དང་རྒྱུར་ཡང་མི་བཟོད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: They cannot match a thousandth part of it, a hundred thousandth part of it, a billionth part of it, a ten billionth part of it, a hundred billionth part of it, a hundred billion trillionth part of it, or even match it in any other calculation, fraction, categorization, analogy, or quality.

source: དེ་ནི་འདི་ལྟར་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་ལྡན་པར་གྱུར་པ་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པར་གྱུར་པ་དེ་དག་ནི་དམིགས་པའི་འདུ་ཤེས་ཅན་ནོ། །དེ་ལྟར་སེམས་ཅན་ཐམས་ཅད་རྒྱུན་ཏུ་ཞུགས་པར་གྱུར་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པར་གྱུར་པ་དང་། སེམས་ཅན་ཐམས་ཅད་རང་སངས་རྒྱས་སུ་གྱུར་པ་དེ་དག་ལ་གོས་དང་། བསོད་སྙོམས་དང་།
en: If you ask why, it is because those aforementioned noble sons or noble daughters who possess the paths of the ten virtuous actions and who possess the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, and the five extrasensory powers, harbor notions of apprehending.

source: མལ་ཆ་དང་ནད་ཀྱི་རྐྱེན་རྩི་དང་། ཡོ་བྱད་མང་པོས་རིམ་གྲོར་བྱེད། བཀུར་སྟིར་བྱེད། བསྟི་སྟང་དུ་བྱེད། མཆོད་པར་བྱེད་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་ཀྱང་དམིགས་པའི་འདུ་ཤེས་ཅན་ནོ།
en: Similarly, those aforementioned noble sons or noble daughters who serve, respect, honor, and worship all beings who enter the stream to nirvāṇa, who are destined for only one more rebirth, who are no longer subject to rebirth, and who have become arhats, as well as all beings who have become pratyekabuddhas, with clothing, alms, bedding, medicines for the treatment of disease, and many resources, harbor notions of apprehending.”

source: །དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞི་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷའི་བུ་སྟོང་ཕྲག་ཉི་ཤུ་དང་འགྲོགས་ཏེ་ཐལ་མོ་སྦྱར་ནས་དགའ་བའི་ཡིད་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ཏེ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །ཀྱེ་མ་བཅོམ་ལྡན་འདས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཐབས་མཁས་པས། དམིགས་སུ་མ་མཆིས་པའི་ཚུལ་དང་། ཆགས་པ་མ་མཆིས་པའི་ཚུལ་དང་། མཚན་མ་མ་མཆིས་པའི་ཚུལ་དང་།
en: Then the Four Great Kings, along with twenty thousand gods of the Caturmahā­rāja­kāyika realm, with their palms together, joyously paid homage to the Blessed One, saying, “O Blessed Lord, bodhisattva great beings who are skilled in means in that manner dedicate those roots of virtuous action to unsurpassed, complete enlightenment by way of nonapprehension, by way of nonattachment, by way of signlessness, and by way of nonaction.

source: བགྱིད་པ་མ་མཆིས་པའི་ཚུལ་གྱིས། དགེ་བའི་རྩ་བ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་ཞིང་།
en: By whatever means they do not resort to duality, nor do they resort to nonduality.

source: ཅི་ནས་ཀྱང་གཉིས་སུ་མི་འགྱུར་བ་དང་གཉིས་མ་ལགས་པར་ཡང་མི་འགྱུར་བ་དེ་ལྟར་ཡོངས་སུ་བསྔོ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཡོངས་སུ་བསྔོ་བ་ཤིན་ཏུ་ཆེའོ། །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་སུམ་ཅུ་རྩ་གསུམ་གྱི་རིས་ཀྱི་ལྷའི་བུ་སྟོང་ཕྲག་དུ་མ་དང་འགྲོགས་ཏེ།
en: So it is that this dedication is the extremely great dedication of bodhisattva great beings.”

source: ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་ཕྲེང་བ་དང་སྤོས་དང་བྱུག་པ་དང་ཕྱེ་མ་དང་ན་བཟའ་དང་། གདུགས་དང་རྒྱལ་མཚན་དང་། ལྷ་རྫས་ཀྱི་བ་དན་མང་པོ་ཐོགས་ཏེ། ལྷ་རྫས་ཀྱི་རོལ་མོ་བྱེད་ཅིང་། ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་། ཕྲེང་བ་དང་སྤོས་དང་བྱུག་པ་དང་ཕྱེ་མ་དང་ན་བཟའ་དང་། གདུགས་དང་རྒྱལ་མཚན་དང་། ལྷ་རྫས་ཀྱི་བ་དན་དེ་དག་གིས། བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས། འདི་སྐད་ཀྱི་ཚིག་བརྗོད་དོ། །བཅོམ་ལྡན་འདས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཐབས་མཁས་པ་མ་དམིགས་སུ་མ་མཆིས་པའི་ཚུལ་དང་། མཚན་མ་མ་མཆིས་པའི་ཚུལ་དང་། བགྱིད་པ་མ་མཆིས་པའི་ཚུལ་གྱིས། དགེ་བའི་རྩ་བ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་ཞིང་།
en: Then Śakra, mighty lord of the gods, along with many thousands of gods of the Trayastriṃśa realm, holding divine flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, and many divine ribbons, as well as playing divine musical sounds, made offerings to the Blessed One with those divine flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, and divine ribbons, and then they said, “Blessed Lord, bodhisattva great beings who are skilled in means in that manner dedicate those roots of virtuous action to unsurpassed, complete enlightenment by way of nonapprehension, by way of signlessness, and by way of nonaction.

source: ཅི་ནས་ཀྱང་གཉིས་སུ་མི་འགྱུར་བ་དང་། གཉིས་མ་ལགས་པར་ཡང་མི་འགྱུར་བ་དེ་ལྟར་ཡོངས་སུ་བསྔོ་བ་དེ་ནི།
en: They do not at all resort to duality, nor do they resort to nonduality.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཡོངས་སུ་བསྔོ་བ་ཤིན་ཏུ་ཆེའོ། །དེ་ནས་ལྷའི་བུ་རབ་མཚེ་མ་དང་རབ་དགའ་ལྡན་དང་རབ་འཕྲུལ་དགའ་དང་ལྷའི་བུ་དབང་བྱེད་ཀྱང་ལྷའི་བུ་སྟོང་ཕྲག་དུ་མ་དང་འགྲོགས་ཏེ། ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་ཕྲེང་བ་དང་སྤོས་དང་བྱུག་པ་དང་ཕྱེ་མ་དང་། ན་བཟའ་དང་གདུགས་དང་།
en: So it is that this dedication is the extremely great dedication of bodhisattva great beings.”

source: རྒྱལ་མཚན་དང་བ་དན་མང་པོ་ཐོགས་ཏེ་ལྷ་རྫས་ཀྱི་རོལ་མོ་བྱེད་ཅིང་། ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་ཕྲེང་བ་དང་སྤོས་དང་བྱུག་པ་དང་ཕྱེ་མ་དང་ན་བཟའ་དང་གདུགས་དང་རྒྱལ་མཚན་དང་ལྷ་རྫས་ཀྱི་བ་དན་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་ནས་འདི་སྐད་ཀྱི་ཚིག་བརྗོད་དོ། །བཅོམ་ལྡན་འདས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་མཁས་པས། དམིགས་སུ་མ་མཆིས་པའི་ཚུལ་དང་མཚན་མ་མ་མཆིས་པའི་ཚུལ་དང་། བགྱིད་པ་མ་མཆིས་པའི་ཚུལ་གྱིས་དགེ་བའི་རྩ་བ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་ཞིང་།
en: Then the gods Suyāma, Saṃtuṣita, Sunirmita, and Vaśavartin, along with many thousands of gods, holding divine flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, and many divine ribbons, as well as playing divine musical sounds, made offerings to the Blessed One with those divine flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, and divine ribbons, and then they said, “Blessed Lord, bodhisattva great beings who are skilled in means in that manner dedicate those roots of virtuous action to unsurpassed, complete enlightenment by way of nonapprehension, by way of signlessness, and by way of nonaction.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཡོངས་སུ་བསྔོ་བ་ཤིན་ཏུ་ཆེའོ།
en: So it is that this dedication is the extremely great dedication of bodhisattva great beings.” {Ki.

source: དེ་ནས་ཚངས་རིས་ཀྱི་ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཐབས་མཁས་པས་ཡོངས་སུ་བཟུང་བ་དེ་དག་གིས། རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་སྔ་མ་ཐབས་མཁས་པ་དང་མི་ལྡན་པ། དམིགས་པའི་སྤྱོད་པ་ཅན་དེ་དག་ནི་དགེ་བའི་རྩ་བ་དེ་དག་ཟིལ་གྱིས་མནན་པ་ངོ་མཚར་ཆེའོ་ཞེས་སྒྲར་བསྒྲགས་ཏེ་དབྱངས་སུ་བརྗོད་དོ། །ཚངས་ལྷ་ཉེ་ཕན་དང་ཚངས་པ་ཀུན་འཁོར་དང་། སྣང་བ་དང་ཆུང་སྣང་དང་ཚད་མེད་སྣང་བ་དང་།
en: II-III: 139} Then many hundred billion trillion gods of Brahmakāyika arrived in that place where the Blessed One was and prostrated with the crown of their heads at the feet of the Blessed One, and loudly gave voice to the following words: ‘Blessed Lord, it is most wonderful that those bodhisattva great beings who practice the perfection of wisdom, and retain it through their skill in means, outshine the roots of virtuous action of the aforementioned noble sons and noble daughters who are without skillful means and who are engaged in apprehending!”

source: ཀུན་སྣང་དང་བ་དང་དགེ་བ་དང་ཆུང་དགེ་དང་ཚད་མེད་དགེ་བ་དང་དགེ་རྒྱས་དང་འབྲས་བུ་ཆེ་བ་དང་། གནས་གཙང་མའི་ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཐབས་མཁས་པས་ཡོངས་སུ་བཟུང་བ་དེ་དག་གིས་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་སྔ་མ་ཐབས་མཁས་པ་དང་མི་ལྡན་པ་དམིགས་པའི་སྤྱོད་པ་ཅན་དེ་དག་གི་དགེ་བའི་རྩ་བ་དེ་དག་ཟིལ་གྱིས་མནན་པ་ངོ་མཚར་ཆེའོ་ཞེས་སྒྲར་བསྒྲགས་ཏེ་དབྱངས་སུ་བརྗོད་དོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་དང་། གནས་གཙང་མའི་རིས་ཀྱི་བར་གྱི་ལྷ་རྣམས་ལ་བཀའ་སྩལ་པ།
en: Then many hundred billion trillion gods of Brahmapurohita, Brahma­pariṣadya, Ābha, Parīttābha, Apramāṇābha, Ābhāsvara, Śubha, Parīttaśubha, Apramāṇaśubha, Śubhakṛtsna, Bṛhatphala, and the Pure Abodes arrived in that place where the Blessed One was and prostrated with the crown of their heads at the feet of the Blessed One, and loudly gave voice to the following words: ‘Blessed Lord, it is most wonderful that those bodhisattva great beings who practice the perfection of wisdom, and retain it through their skill in means, outshine the roots of virtuous action of the aforementioned noble sons and noble daughters who are without skillful means and who are engaged in apprehending!”

source: ལྷའི་བུ་དག་གལ་ཏེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཞུགས་པར་གྱུར་ཏེ། ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འདས་པ་དང་། མ་བྱོན་པ་དང་ད་ལྟར་བྱུང་བ་དེ་དག་ཐམས་ཅད་དང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་དེ་དག་གི་སེམས་དང་པོ་བསྐྱེད་པ་ནས། དམ་པའི་ཆོས་གནས་པའི་བར་གྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཉན་ཐོས་དེ་དག་དང་། རང་སངས་རྒྱས་དེ་དག་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའམ། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའམ། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པའམ། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའམ། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པའམ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའམ། སྦྱིན་པའམ། ཚུལ་ཁྲིམས་སམ། བཟོད་པའམ། བརྩོན་འགྲུས་སམ། བསམ་གཏན་ནམ། ཤེས་རབ་འམ། ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་འམ། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་འམ། ཤེས་རབ་ཀྱི་ཕུང་པོ་འམ། རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་འམ། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོ་འམ། སངས་རྒྱས་ཀྱི་ཆོས་ཚད་མེད་པ་གཞན་དག་ཀྱང་རུང་སྟེ། དེ་དག་ཐམས་ཅད་གཅིག་ཏུ་བསྡུས་ནས། རྗེས་སུ་ཡི་རང་བར་བྱས་ལ། དེ་ལྟར་རྗེས་སུ་ཡི་རང་ནས་ཀྱང་། དམིགས་པའི་ཚུལ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་པ་བས།
en: Then the Blessed One said to the gods of the Caturmahā­rāja­kāyika realm and those [of the other realms], up to and including the Pure Abodes, “Divine princes, suppose that all the beings of the great trichiliocosm, as many as they are, had entered into unsurpassed, complete enlightenment and gathered together all those attributes of the past, future, and present tathāgatas, arhats, completely awakened buddhas of the ten directions, along with their śrāvakas and pratyekabuddhas, and those of the lord buddhas from the time when they first begin to set their mind on enlightenment to as long as their Dharma endures, along with their śrāvakas, pratyekabuddhas, and all beings—attributes comprising their perfection of generosity, their perfection of ethical discipline, their perfection of tolerance, their perfection of perseverance, their perfection of meditative concentration, and their perfection of wisdom; and their [ordinary] generosity, ethical discipline, tolerance, perseverance, meditative concentration, and wisdom; and their aggregate of ethical discipline, their aggregate of meditative stability, their aggregate of wisdom, their aggregate of liberation, and their aggregate of seeing the wisdom of liberation; and the other immeasurable attributes of the buddhas, whatever they might be—and suppose they were to rejoice in them, and having rejoiced in that manner, were indeed to dedicate these to unsurpassed, complete enlightenment by way of apprehending.

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པར་གྱུར་ཏེ། དེས་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཉན་ཐོས་དང་རང་སངས་རྒྱས་སུ་བཅས་པ་དག་གི་སེམས་དང་པོ་བསྐྱེད་པ་ནས། དམ་པའི་ཆོས་གནས་པའི་བར་གྱི། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའམ། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའམ། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པའམ། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའམ། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པའམ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའམ། གཞན་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་ཚད་མེད་པའི་བར་དེ་དག་ཐམས་ཅད་གཅིག་ཏུ་བསྡུས་ཏེ། དམིགས་སུ་མེད་པའི་ཚུལ་དང་། གཉིས་སུ་མེད་པའི་ཚུལ་དང་། མཚན་མ་མེད་པའི་ཚུལ་དང་། ཆགས་པ་མེད་པའི་ཚུལ་དང་། བྱེད་པ་མེད་པའི་ཚུལ་དུ་རྗེས་སུ་ཡི་རང་བའི་རབ་ཀྱིས་རྗེས་སུ་ཡི་རང་བ་དང་། རྗེས་སུ་ཡི་རང་བའི་གཙོ་བོ་དང་།
en: If, compared to them, some noble son or noble daughter had entered into unsurpassed, complete enlightenment and gathered together all those attributes of the lord buddhas of the past, future, and present, from the time when they first begin to set the mind on enlightenment {Ki.

source: དམ་པ་དང་མཆོག་དང་ཕུལ་དང་གྱ་ནོམ་པ་དང་བླ་ན་མེད་པ་དང་གོང་ན་མེད་པ་དང་མཉམ་པ་མེད་པ་དང་མི་མཉམ་པ་དང་མཉམ་པས་རྗེས་སུ་ཡི་རང་ནས། རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་དགེ་བའི་རྩ་བ་དེ་མི་དམིགས་པའི་ཚུལ་དང་། གཉིས་སུ་མེད་པའི་ཚུལ་དང་། མཚན་མ་མེད་པའི་ཚུལ་དང་། ཆགས་པ་མེད་པའི་ཚུལ་དང་།
en: II-III: 140} to as long as their Dharma endures, along with their śrāvakas and pratyekabuddhas—attributes comprising their perfection of generosity, their perfection of ethical discipline, their perfection of tolerance, their perfection of perseverance, their perfection of meditative concentration, and their perfection of wisdom, [and so forth], up to and including the other immeasurable attributes of the buddhas, whatever they might be—and if they were to rejoice in them,—rejoicing by way of nonapprehension, by way of nonduality, by way of signlessness, by way of nonattachment, and by way of nonaction,—and if they were to rejoice in them—rejoicing with this foremost, sacred, supreme, perfect, sublime, unsurpassed, and highest of rejoicing that is unequaled and equal to the unequaled—and were then to dedicate those roots of virtuous action endowed with rejoicing to unsurpassed, complete enlightenment, by way of nonapprehension, by way of nonduality, by way of signlessness, by way of nonattachment, and by way of nonaction, compared to the former noble sons or noble daughters, the merit of this one noble son or noble daughter would increase manifold to a greater extent.

source: བྱེད་པ་མེད་པའི་ཚུལ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་ན། རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེ་ནི་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་སྔ་མ་དེ་དག་བས་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ཏེ། དགེ་བའི་རྩ་བ་འདི་ལ་ནི་དགེ་བའི་རྩ་བ་སྔ་མ་དེས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: The aforementioned roots of virtuous action would come nowhere near even a hundredth part of that one’s roots of virtuous action.

source: །རྒྱུའི་བར་དུ་ཡང་མི་བཟོད་དོ།
en: They would not match them [in any way], up to and including in quality.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དམིགས་སུ་མེད་པའི་ཚུལ་གྱིས་ཡོངས་སུ་བསྔོ་བ་འདི་ནི་མཆོག་ཅེས་བྱའོ།
en: This dedication of bodhisattva great beings that is made without apprehending anything is said to be supreme, [and so forth].

source: །མི་མཉམ་པ་དང་མཉམ་པའི་བར་ཞེས་བྱའོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: It is said to be equal to the unequaled.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་གང་དེ་སྐད་དུ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་གིས། དགེ་བའི་རྩ་བ་དེ་དག་ཐམས་ཅད་མངོན་བར་བསྡུས་ཏེ་གཅིག་ཏུ་བརྟུལ་ནས་ཚད་བཟུང་སྟེ། རྗེས་སུ་ཡི་རང་བའི་རབ་ཀྱིས་རྗེས་སུ་ཡི་རང་བ་དང་། རྗེས་སུ་ཡི་རང་བ་མི་མཉམ་པ་དང་མཉམ་པའི་བར་གྱིས།
en: Then the venerable Subhūti inquired of the Blessed One, “The Blessed Lord has said that the noble sons or noble daughters who have gathered, assimilated, and evaluated all those roots of virtuous action rejoice in them with the best of rejoicing, [and so forth], up to and including rejoicing that is unequaled, and equal to the unequaled.

source: རྗེས་སུ་ཡི་རང་བར་བྱེད་དོ་ཞེས་བཀའ་སྩལ་པ། བཅོམ་ལྡན་འདས་ཇི་ཙམ་གྱིས་ན་རྗེས་སུ་ཡི་རང་བའི་དམ་པར་འགྱུར།
en: Blessed Lord, how is this the best of rejoicing?

source: ཇི་ཙམ་གྱིས་ན་རྗེས་སུ་ཡི་རང་བའི་མི་མཉམ་པ་དང་མཉམ་པའི་བར་དུ་འགྱུར་བ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: How is it rejoicing that is equal to the unequaled, [and so forth]?”

source: ནམ་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེ་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་རྣམས་དང་། རང་སངས་རྒྱས་དེ་དག་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་དེ་དག་མི་ལེན་མི་གཏོང་བ་དང་། མི་རློམ་མི་འཇུམ་ཞིང་། དམིགས་པ་ཡང་མ་ཡིན། མི་དམིགས་པ་ཡང་མ་ཡིན་ལ། དེ་འདི་སྙམ་དུ་འདི་ལ་
en: The Blessed One replied, “When noble sons or noble daughters neither accept nor reject those roots of virtuous action of the tathāgatas, arhats, completely awakened buddhas of the past, future, and present, along with their saṅghas of śrāvakas, pratyekabuddhas, and all beings, and when they neither make assumptions about them, nor shirk away from them or apprehend them, but instead think that in them there is nothing at all that arises, nothing at all that ceases, nothing at all that is afflicted, nothing at all that is purified, nothing at all that decreases, nothing at all that increases, nothing at all that comes, and nothing at all that is aggregated, and, as this formulation explains, say, ‘I will rejoice on the basis of the real nature of phenomena of the past, future, and present, the unmistaken real nature, the one and only real nature, reality, the abiding nature of reality, and maturity with respect to all phenomena!

source: ཆོས་གང་ཡང་སྐྱེ་བ་ཡང་མེད། འགགས་པ་ཡང་མེད། ཉོན་མོངས་པར་འགྱུར་བ་ཡང་མེད། རྣམ་པར་བྱང་བར་འགྱུར་བ་ཡང་མེད་དེ། ཆོས་དེ་དག་ལ་འགྲིབ་པ་ཡང་མེད། འཕེལ་བ་ཡང་མེད། འོང་བ་ཡང་མེད། ཕུང་པོར་འགྱུར་བ་ཡང་མེད་དོ་ཞེས་རྣམ་གྲངས་དེ་ལྟ་བུས་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་དང་། མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། ཆོས་ཉིད་དང་། ཆོས་ཀྱི་གནས་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་ཇི་ལྟ་བ་དེ་ལྟར་བདག་གིས་རྗེས་སུ་ཡི་རང་བར་བྱའོ། །རྗེས་སུ་ཡི་རང་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོའོ་ཞེས་དེ་ལྟར་ཡོངས་སུ་བསྔོ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྗེས་སུ་ཡི་རང་བ་དེ་ནི་དམ་པར་འགྱུར་ཏེ།
en: Having rejoiced in them, I will dedicate these roots of virtuous action to unsurpassed, complete enlightenment,’ the rejoicing that bodhisattva great beings have when they make their dedication in that manner is the best.

source: རྗེས་སུ་ཡི་རང་བ་དེ་དག་ནི་མི་མཉམ་པ་དང་མཉམ་པའི་བར་དུ་འགྱུར་རོ།
en: The rejoicing that they have is equal to the unequaled, [and so forth]. “

source: །རབ་འབྱོར་རྗེས་སུ་ཡི་རང་བ་འདི་ལ་ནི་དེ་མ་ཡིན་པའི་རྗེས་སུ་ཡི་རང་བ་གཞན་ཐམས་ཅད་ཀྱིས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: Subhūti, all extraneous sorts of rejoicing other than this come nowhere near even a hundredth part of this rejoicing.

source: །རྒྱུའི་བར་དུ་ཡང་མི་བཟོད་དེ།
en: They do not match it [in any way], up to and including in quality.

source: རྗེས་སུ་ཡི་རང་བ་འདི་ནི་དེ་མ་ཡིན་པའི་རྗེས་སུ་ཡི་རང་བ་གཞན་དག་པས་རབ་ཅེས་བྱའོ། །གཙོ་བོ་ཞེས་བྱའོ། །དམ་པ་ཞེས་བྱའོ། །མཆོག་ཅེས་བྱའོ།
en: This rejoicing is said to be best, in comparison to other, extraneous sorts of rejoicing.

source: །ཕུལ་ཞེས་བྱའོ། །གྱ་ནོམ་པ་ཞེས་བྱའོ། །བླ་ན་མེད་པ་ཞེས་བྱའོ། །གོང་ན་མེད་པ་ཞེས་བྱའོ། །མཉམ་པ་མེད་པ་ཞེས་བྱའོ།
en: It is said to be foremost, it is said to be sacred, it is said to be perfect, it is said to be supreme, it is said to be sublime, it is said to be unsurpassed, it is said to be highest, it is said to be unequaled, and it is said to be equal to the unequaled. “

source: །མི་མཉམ་པ་དང་མཉམ་པ་ཞེས་བྱའོ། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོས་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་སུ་བཅས་པ་དེ་དག་གི་སེམས་དང་པོ་བསྐྱེད་པ་ནས། དམ་པའི་ཆོས་གནས་པའི་བར་གྱི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Moreover, Subhūti, when noble sons or noble daughters who follow the vehicle of the bodhisattvas {Ki.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པའི་དགེ་བའི་རྩ་བ་དང་གཞན་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་ཚད་མེད་པའི་བར་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ལ་རྗེས་སུ་ཡི་རང་བར་འདོད་ན།
en: II-III: 141} wish to rejoice in the roots of virtuous action belonging to the tathāgatas, arhats, completely awakened buddhas of the past, future, and present, along with their śrāvakas and pratyekabuddhas, from the time when they first begin to set their mind on enlightenment to as long as their Dharma endures—attributes comprising the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, and all other attributes, up to and including the immeasurable attributes of the buddhas, as well as all the roots of virtuous action of all beings, as many as there are—then they should rejoice as follows: ‘Just like liberation are physical forms.

source: འདི་ལྟར་རྗེས་སུ་ཡི་རང་བར་བྱའོ། །རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ནི་གཟུགས་སོ།
en: Just like liberation are feelings.

source: །རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ནི་ཚོར་བ་དང་། འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་རྣམས་སོ།
en: Just like liberation are perceptions, formative predispositions, and consciousness.

source: །རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ནི་སྐྱེ་མཆེད་རྣམས་དང་ཁམས་རྣམས་སོ། །རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ནི་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའོ།
en: Just like liberation are the sense fields, the sensory elements, and the links of dependent origination.

source: །རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ནི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: Just like liberation is the perfection of generosity.

source: །རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: Just like liberation are the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: །རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ནི་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་རོ།
en: Just like liberation are the emptiness of internal phenomena and the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.
